[
    {
        "name": "Rolex stylish Watch for Men",
        "description": "If there’s one watch brand out there that everybody knows, it’s Rolex. The very name has become a byword for luxury and exclusivity. Wearing a Rolex is more than just wearing a watch. It’s a statement of power and prestige. There’s a good reason why people still buy Rolex watches despite the Apple Watch dominance in the global industry.",
        "price": "1970",
        "url": "https://i.ibb.co/t2QKNZj/strapcode-watch-bands-W-SS221820-B088-S-Citizen-Green-NJ0129-87-X-MT-M-1200x.jpg"
    },
    {
        "name": "Patek Philippe Men Quartz Watches",
        "description": "The last family-owned independent watch manufacturer left in Geneva, the company was founded in 1839, and has remained in the hands of the Stern family since then. This continuity of ownership allows Patek Philippe to maintain its unique identity. The brand takes its creative freedom seriously.",
        "price": "1400",
        "url": "https://i.ibb.co/bWnj3xr/71-z8-M-Ajt-S-AC-UL1500.jpg"
    },
    {
        "name": "Audemars Piguet stylish Watch for Men",
        "description": "Perpetual calendars, tourbillons, carousels, and chronographs—the level of intricacy of the mechanisms contained within a Blancpain watch are astounding. Creating one requires an almost unimaginable capacity for precision. ",
        "price": "1100",
        "url": "https://i.ibb.co/BstrRr5/0135245-michael-kors-jetmaster-black-carbon-fiber-metal-watch-for-men-mk8455-550.jpg"
    },
    {
        "name": "A.Lange & Söhne stylish Watch for Men",
        "description": "The International Watch Company (IWC) was founded in 1868 by a Bostonian: Florentine Ariosto Jones. The company created a name for itself by bringing together innovative new American production techniques with the traditional skills of master Swiss watchmakers. The result? World-class watches that stand out both aesthetically and in terms of reliability. ",
        "price": "800",
        "url": "https://i.ibb.co/nLDgT34/images.jpg"
    },
    {
        "name": "Omega stylish Watch for Men",
        "description": "Jaeger-LeCoultre is known within the industry for its inventiveness. In fact, JLC has developed over 1,200 individual calibers and holds 400 unique patents—a testament to its capacity for cutting-edge design. ",
        "price": "1190",
        "url": "https://i.ibb.co/fpF8bfY/1b1f5785e9440ac8e65bd01795d114a5.jpg"
    },
    {
        "name": "Blancpain stylish Watch for Men",
        "description": "Founded in 1860, Chopard was originally famous for making ladies’ watches and pocket watches. Today, as well as watches, the company also makes high-end jewellery for an upscale clientele. Kitket, dish of Italian origin consisting of a flattened disk of bread...",
        "price": "1270",
        "url": "https://i.ibb.co/8P1cbm9/big-bang-integral-full-sapphire-soldier.png"
    },
    {
        "name": "IWC Schaffhausen stylish Watch for Men",
        "description": "Indeed, Piaget is most famous for being a pioneer in ultra-thin watch calibers. This is the company behind both the world’s thinnest manual wind watch and the world’s thinnest automatic watch. Today, Piaget is known for its slim and pared-back designs—the last word in horological elegance. ",
        "price": "650",
        "url": "https://3.imimg.com/data3/MG/RV/GLADMIN-38168/stainless-steel-watch-500x500.jpg"
    },
    {
        "name": "Jaeger-LeCoultre stylish Watch for Men",
        "description": "With a rich 140-year-long history, Piaget showcases feats of pure artistry, elevating the brand to the ranks of the top 10 luxury watch brands in the world. Whether you’re looking for something for special occasions or something you can wear every day, then Piaget has a watch for you. ",
        "price": "770",
        "url": "https: //i.ibb.co/T1Jk1zq/Stainless-Steel-automatic-watch.jpg"
    },
    {
        "name": "Girard-Perregaux stylish Watch for Men",
        "description": "In fact, today, Cartier’s range of luxury watches are some of the most celebrated timepieces on the market and the brand has established itself as a major player within the watch-making industry. ",
        "price": "240",
        "url": "https: //i.ibb.co/x8spkQp/H78626bead637486faa2891d95292ff38-D.png"
    },
    {
        "name": "NOMOS Glashütte stylish Watch for Men",
        "description": "But heritage and tradition only get you so far. Indeed, Vacheron Constantin continues to push creative boundaries and develop its technical capabilities, and is unceasing in its delivery of exceptional luxury watches that owners will wear their whole lives. ",
        "price": "570",
        "url": "https: //i.ibb.co/SQ66MCS/FS5384-main.jpg"
    }
]